#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-Kdbu7aDzN2UMYbzU

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_droplet.opl-docs: Refreshing state... [id=353487911]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_s3_bucket.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_record.opl-docs: Refreshing state... [id=373168443]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
digitalocean_project.blackboards: Drift detected (update)
digitalocean_droplet.opl-docs: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.opl-docs must be replaced
-/+ resource "digitalocean_droplet" "opl-docs" {
      ~ created_at           = "2023-05-03T05:46:04Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "353487911" -> (known after apply)
      ~ ipv4_address         = "139.59.191.7" -> (known after apply)
      ~ ipv4_address_private = "10.131.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "opl-docs"
      ~ price_hourly         = 0.00893 -> (known after apply)
      ~ price_monthly        = 6 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          - "38210829",
        ] -> (known after apply) # forces replacement
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:353487911" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "a1c4e609-4bda-4513-a0c4-230fbfcfdd3d" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # digitalocean_project.blackboards will be updated in-place
  ~ resource "digitalocean_project" "blackboards" {
        id          = "d006b183-c896-4d41-a341-fb46d729eeb6"
        name        = "blackboards"
      ~ resources   = [
          - "do:domain:blackboards.pl",
          - "do:domain:opentracker.app",
          - "do:droplet:332540871",
          - "do:droplet:353487911",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # digitalocean_record.opl-docs will be updated in-place
  ~ resource "digitalocean_record" "opl-docs" {
        id       = "373168443"
        name     = "opl-docs"
      ~ value    = "139.59.191.7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # digitalocean_ssh_key.tara will be created
  + resource "digitalocean_ssh_key" "tara" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "m2"
      + public_key  = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDJIknWlPgy7MB4Akh+3nIIsgqg1GjY0Q/11+CU6plOZY6JsGFmmtyMqdZmY3Ql43a5tIe8tHWQF0BkgZuHQCwEFmPRazbfqj+nkSv6pqmFBePWNtzFf/XwwDdDaXkSeVTuNZShWEjs8r4mHUZR7oxLDMedyjiMVKWu4DLqfqsiBJ/dReFDz766lYIZrg1u8FoncrzLZOKIE7wPSiSLkUTTgGdJmXGOIcrUUZjmlFdJwm3fS449iPGlL0pgxzHAnv90PoB6Vkn1+s4H57yDlZz4jxmgciq4Z5rDYKOUtkn8llAuzsKh9SWdeonC2oINCQM4XYMU0Kpq1s7c5UkjOzzlllh+5JYLgLIjIKV23GTd5Hg3oKl9/aASCIpYGRZgcx7fHYWyVdFXl9Pwa6OOFDwTyGivOSnOCc1j12Ox1f7BMArxtbLEOhC6BXYFaRU3STvZF30tLRBpxp+IAX+IMkf8fDnV5pksP4qIyqSQCRFzdyIMLBOHQgUrIrBN8xB2gUM= tarap@MacBook-Pro.broadband
        EOT
    }

Plan: 2 to add, 2 to change, 1 to destroy.

```

</details>